# Titanic Data set

In [50]:
import numpy as np
import pandas as pd

In [51]:
train_data=pd.read_csv("D:\ML\ML\dataset\\titanictrain.csv" )
train_data1=pd.read_csv("D:\ML\ML\dataset\\titanictrain.csv" )

In [52]:
train_data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:
train_data1.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [54]:
train_data["Embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

# A bit about data set

P class columns contai a number in which  indicate the class of the passneger ticket : 1 for first
2: second's, 3: third class 

This could function  as proy for the scoic economy of the passengerr upper, middle, lower class

The SibSp columns belong to the siblling+ spouse also abroad the titanic data ste

The parch columns indicate the number of parent and children  also abroad the titanic data ste

The ticket column contain the ticket number of the passenger

The cabin couumn contain the if she or he had a cabin or lastly

Embarked imposed the embarked of the passenger chubrog  Queentoen Shantamt

In [55]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

# the dataframe contains 819 entries and 12 features.Of those 12 feature 10 have non null value and the 2 have null values as age and cabin, obiviouslt everyone has not been alloted cabin

# Dropping columns which are not useful

In [56]:
col=['Name', 'Ticket','Cabin']
train_data=train_data.drop(col,axis=1)
train_data1=train_data1.drop(col,axis=1)

In [57]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 9 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null float64
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(2)
memory usage: 62.8+ KB

# Dropping rows which are not useful

In [58]:
train_data=train_data.dropna()

In [59]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 9 columns):
PassengerId    712 non-null int64
Survived       712 non-null int64
Pclass         712 non-null int64
Sex            712 non-null object
Age            712 non-null float64
SibSp          712 non-null int64
Parch          712 non-null int64
Fare           712 non-null float64
Embarked       712 non-null object
dtypes: float64(2), int64(5), object(2)
memory usage: 55.6+ KB

# More than  100 data are missing which mean have certain vale
Problem for dropping the variables

# Creating dummy variable, Now we convert the Pclass, sex, embarked  to columns in pandas and then drop them.

In [60]:
dummies=[]

col=['Pclass','Sex','Embarked']
for c in col:
    dummies.append(pd.get_dummies(train_data1[c]))
titanic_dummies=pd.concat(dummies, axis=1)

In [61]:
# in dummy variable we try to generalize the dataa in that format

# And finally we oncatenate with original dataframe column wise

In [62]:
train_data1=pd.concat((train_data1,titanic_dummies),axis=1)

# Now we converted Pclass,Sex,Embarked into columns where we drop the same redudant same columns from the data

In [63]:
train_data1=train_data1.drop(['Pclass','Sex','Embarked'],axis=1)

In [64]:
train_data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null float64
1              891 non-null uint8
2              891 non-null uint8
3              891 non-null uint8
female         891 non-null uint8
male           891 non-null uint8
C              891 non-null uint8
Q              891 non-null uint8
S              891 non-null uint8
dtypes: float64(2), int64(4), uint8(8)
memory usage: 48.9 KB

# Taking care of missing data

# all is good, excepted age which has a lots of missing values,Lets compute a median or interpole () ages and fill those missing age values. Ppandas has interpole value  ehich fill the missing value with interpole value

In [66]:
train_data1['Age']=train_data1['Age'].interpolate()

# Now lets observe the data columns. Note age which is interpolate now with imputed new values

In [67]:
train_data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Age            891 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null float64
1              891 non-null uint8
2              891 non-null uint8
3              891 non-null uint8
female         891 non-null uint8
male           891 non-null uint8
C              891 non-null uint8
Q              891 non-null uint8
S              891 non-null uint8
dtypes: float64(2), int64(4), uint8(8)
memory usage: 48.9 KB

# Converting dataframe to numpy
Now that we have converted to all the data to numeric,its time for preparing the data for machine learning
This is where scikit snd numpy to play. X= input set with 14 attributes, y= small y Output, in this case 'Survived' Now we convert  our dataframe to numpy  and we assing input and output.